Revit 2027 API
ParameterTypeId.StairsRunExtendBelowTreadBase Property
 "Extend Below Tread Base": Extend Below Tread Base
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunExtendBelowTreadBase { get; }
Public Shared ReadOnly Property StairsRunExtendBelowTreadBase As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunExtendBelowTreadBase {
	ForgeTypeId^ get ();
}
static member StairsRunExtendBelowTreadBase : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace